Repository: Bou-eng/Risale-App
Catalog: lib/l10n/app_*.arb
Languages: ar, tr

# appTitle
source: Risale App
ar: تطبيق الرسالة
tr: Risale Uygulaması

source: Students
ar: الطلاب
tr: Öğrenciler

source: Reports
ar: التقارير
tr: Raporlar

source: Monthly Meeting
ar: الاجتماع الشهري
tr: Aylık Toplantı

source: Finish Meeting
ar: إنهاء الاجتماع
tr: Toplantıyı Bitir

source: Change School
ar: تغيير المدرسة
tr: Camii Değiştir

source: Change Date
ar: تغيير التاريخ
tr: Tarihi Değiştir

source: Save
ar: حفظ
tr: Kaydet

# exportDayReportPdf
source: Export Day Report
ar: تصدير تقرير اليوم
tr: Günlük Raporu Dışa Aktar

# exportGeneralReportPdf
source: Export General Report
ar: تصدير التقرير العام
tr: Genel Raporu Dışa Aktar

# reportSaved
source: Report saved successfully
ar: تم حفظ التقرير بنجاح
tr: Rapor başarıyla kaydedildi

# meetingFinishedPointsReset
source: Meeting finished and points reset
ar: تم إنهاء الاجتماع وإعادة تعيين النقاط
tr: Toplantı sona erdi ve puanlar sıfırlandı

source: Error
ar: خطأ
tr: Hata

source: OK
ar: موافق
tr: Tamam

source: Cancel
ar: إلغاء
tr: İptal

# emptyStateSelectSchool
source: Please select a school
ar: يرجى اختيار الجامع
tr: Lütfen bir Camii seçin

source: Delete
ar: حذف
tr: Sil

source: Edit
ar: تعديل
tr: Düzenle

source: Add
ar: إضافة
tr: Ekle

source: Back
ar: رجوع
tr: Geri

source: Search
ar: بحث
tr: Ara

source: No data
ar: لا توجد بيانات
tr: Veri yok

source: Loading...
ar: جاري التحميل...
tr: Yükleniyor...

source: Success
ar: نجح
tr: Başarılı

source: Warning
ar: تحذير
tr: Uyarı

# confirmDelete
source: Are you sure you want to delete this item?
ar: هل أنت متأكد من حذف هذا البند؟
tr: Bu öğeyi silmek istediğinizden emin misiniz?

source: Language
ar: اللغة
tr: Dil

source: Settings
ar: الإعدادات
tr: Ayarlar

source: Profile
ar: الملف الشخصي
tr: Profil

source: Logout
ar: تسجيل الخروج
tr: Çıkış Yap

# notes
source: Notes (optional)
ar: ملاحظات (اختيارية)
tr: Notlar (isteğe bağlı)

source: Date
ar: التاريخ
tr: Tarih

source: School
ar: الجامع
tr: Okul

source: Teacher
ar: المعلم
tr: Öğretmen

# schoolClass
source: Class
ar: الفصل
tr: Sınıf

source: Student
ar: الطالب
tr: Öğrenci

source: Student Report
ar: تقرير الطالب
tr: Öğrenci Raporu

source: Day Report
ar: تقرير اليوم
tr: Günlük Rapor

source: General Report
ar: التقرير العام
tr: Genel Rapor

# generalReportTitle
source: General School Report
ar: التقرير العام للمدرسة
tr: Genel Camii Raporu

source: Passed Lessons
ar: الدروس الناجحة
tr: Başarılı Dersler

source: Repeated Lessons
ar: الدروس المكررة
tr: Tekrarlanan Dersler

source: Points
ar: نقاط
tr: Puanlar

source: Attitude
ar: السلوك
tr: Davranış

source: Good
ar: جيد
tr: İyi

source: Medium
ar: متوسط
tr: Orta

source: Bad
ar: سيء
tr: Kötü

# passedWithPoints
source: Passed (+1 point)
ar: نجح (+1 نقطة)
tr: Geçti (+1 puan)

# repeatWithPoints
source: Repeat (0 points)
ar: إعادة (0 نقاط)
tr: Tekrar (0 puan)

# goodWithPoints
source: Good (+2 points)
ar: جيد (+2 نقاط)
tr: İyi (+2 puan)

# mediumWithPoints
source: Medium (+1 point)
ar: متوسط (+1 نقطة)
tr: Orta (+1 puan)

# badWithPoints
source: Bad (-1 point)
ar: سيء (-1 نقطة)
tr: Kötü (-1 puan)

# pointsForEntry
source: Points for this entry: {points}
ar: نقاط هذا الإدخال: {points}
tr: Bu kayıt için puan: {points}

# languageArabic
source: Arabic
ar: العربية
tr: Arapça

# languageTurkish
source: Turkish
ar: التركية
tr: Türkçe

# languageEnglish
source: English
ar: الإنجليزية
tr: İngilizce

# pageStudied
source: Pages Studied
ar: الصفحات المدروسة
tr: Çalışılan Sayfalar

source: Home
ar: الرئيسية
tr: Ana Sayfa

source: Lesson
ar: الدرس
tr: Ders

source: Lessons
ar: الدروس
tr: Dersler

source: Home (placeholder)
ar: الصفحة الرئيسية (تجريبي)
tr: Ana Sayfa (yer tutucu)

source: Selected School ID
ar: معرّف الجامع المحددة
tr: Seçili Camii ID

source: Selected Date
ar: التاريخ المحدد
tr: Seçili Tarih

source: Take Attendance
ar: أخذ الحضور
tr: Yoklama Al

source: No school selected
ar: لم يتم اختيار الجامع
tr: Camii seçilmedi

source: No school or date selected
ar: لم يتم اختيار جامع أو تاريخ
tr: Camii veya tarih seçilmedi

# selectSchoolInProfile
source: Please add or select a school in Profile.
ar: يرجى إضافة الجامع أو اختياره من الملف الشخصي.
tr: Lütfen profilinizden Camii ekleyin veya seçin.

source: Open Teacher Profile
ar: فتح ملف المعلم
tr: Öğretmen Profilini Aç

source: Loading reports...
ar: جار تحميل التقارير...
tr: Raporlar yükleniyor...

source: Loading meeting data...
ar: جار تحميل بيانات الاجتماع...
tr: Toplantı verileri yükleniyor...

source: Loading students...
ar: جار تحميل الطلاب...
tr: Öğrenciler yükleniyor...

# monthlyMeetingNotes
source: Monthly Meeting
ar: الاجتماع الشهري
tr: Aylık Toplantı

source: Edit monthly meeting notes
ar: تعديل ملاحظات الاجتماع الشهري
tr: Aylık toplantı notlarını düzenle

source: Lesson Entries
ar: سجلات الدروس
tr: Ders Kayıtları

source: No lesson entries found
ar: لا توجد سجلات للدروس
tr: Ders kaydı bulunamadı

source: Student Details
ar: تفاصيل الطالب
tr: Öğrenci Detayları

source: Student Information
ar: معلومات الطالب
tr: Öğrenci Bilgileri

source: Basic Information
ar: المعلومات الأساسية
tr: Temel Bilgiler

source: Statistics
ar: الإحصائيات
tr: İstatistikler

source: Total Entries
ar: إجمالي السجلات
tr: Toplam Kayıt

source: Total Points Delta
ar: إجمالي تغير النقاط
tr: Toplam Puan Değişimi

source: Passed / Repeat
ar: نجح / إعادة
tr: Başarılı / Tekrar

# attitudeSummary
source: Attitude (Good/Medium/Bad)
ar: السلوك (جيد/متوسط/سيء)
tr: Davranış (İyi/Orta/Kötü)

source: Date Range
ar: نطاق التاريخ
tr: Tarih Aralığı

source: Export PDF
ar: تصدير PDF
tr: PDF Dışa Aktar

source: Student not found
ar: الطالب غير موجود
tr: Öğrenci bulunamadı

source: Name
ar: الاسم
tr: İsim

source: First Name
ar: الاسم الأول
tr: Ad

source: Last Name
ar: اسم العائلة
tr: Soyad

source: Parent Phone Number
ar: رقم هاتف ولي الأمر
tr: Veli Telefonu

source: Current Points
ar: النقاط الحالية
tr: Mevcut Puan

source: Lesson Logging Mode
ar: وضع تسجيل الدروس
tr: Ders Kayıt Modu

# oneEntryPerDay
source: One entry per student per day
ar: إدخال واحد لكل طالب في اليوم
tr: Günde öğrenci başına tek kayıt

source: Multiple entries per day
ar: إدخالات متعددة في اليوم
tr: Günde birden fazla kayıt

source: Logging Mode
ar: وضع التسجيل
tr: Kayıt Modu

# noSchools
source: No schools added yet
ar: لم تتم إضافة جوامع بعد
tr: Henüz Camii eklenmedi

source: Add School
ar: إضافة جامع
tr: Camii Ekle

source: Edit School
ar: تعديل الجامع
tr: Camii Düzenle

source: Delete School
ar: حذف الجامع
tr: Camii Sil

source: Delete Student
ar: حذف الطالب
tr: Öğrenciyi Sil

# confirmDeleteStudent
source: Are you sure you want to delete the student
ar: هل أنت متأكد من حذف الطالب
tr: Öğrenciyi silmek istediğinize emin misiniz

# confirmDeleteSchool
source: Are you sure you want to delete the school
ar: هل أنت متأكد من حذف المدرسة
tr: Camii silmek istediğinize emin misiniz

source: School deleted
ar: تم حذف الجامع
tr: Camii silindi

source: School updated
ar: تم تحديث الجامع
tr: Camii güncellendi

source: School added
ar: تمت إضافة الجامع
tr: Camii eklendi

source: Teacher Profile
ar: ملف المعلم
tr: Öğretmen Profili

source: Teacher profile saved
ar: تم حفظ ملف المعلم
tr: Öğretmen profili kaydedildi

source: Teacher Setup
ar: إعداد المعلم
tr: Öğretmen Kurulumu

# setupTitle
source: Teacher Setup
ar: إعداد المعلم
tr: Öğretmen Kurulumu

source: Complete Setup
ar: إكمال الإعداد
tr: Kurulumu Tamamla

source: Teacher Information
ar: معلومات المعلم
tr: Öğretmen Bilgileri

source: School Name
ar: اسم الجامع
tr: Camii Adı

source: Lessons Count
ar: عدد الدروس
tr: Ders Sayısı

# schoolNameRequired
source: School name is required
ar: اسم الجامع مطلوب
tr: Camii adı gerekli

# lessonsCountRange
source: Lessons count must be between 1 and 20
ar: يجب أن يكون عدد الدروس بين 1 و 20
tr: Ders sayısı 1 ile 20 arasında olmalıdır

# fillAllTeacherFields
source: Please fill in all teacher fields
ar: يرجى تعبئة جميع بيانات المعلم
tr: Lütfen tüm öğretmen alanlarını doldurun

# fillAllFields
source: Please fill in all required fields
ar: يرجى تعبئة جميع الحقول المطلوبة
tr: Lütfen tüm gerekli alanları doldurun

# addAtLeastOneSchool
source: Please add at least one school
ar: يرجى إضافة الجامع واحدة على الأقل
tr: Lütfen en az bir Camii ekleyin

source: Setup already completed
ar: تم إكمال الإعداد بالفعل
tr: Kurulum zaten tamamlandı

source: Error loading data
ar: حدث خطأ أثناء تحميل البيانات
tr: Veri yüklenirken hata

source: Error saving report
ar: حدث خطأ أثناء حفظ التقرير
tr: Rapor kaydedilirken hata

source: Error exporting PDF
ar: حدث خطأ أثناء تصدير ملف PDF
tr: PDF dışa aktarılırken hata

source: Error generating PDF
ar: حدث خطأ أثناء إنشاء ملف PDF
tr: PDF oluşturulurken hata

source: Error finishing meeting
ar: حدث خطأ أثناء إنهاء الاجتماع
tr: Toplantı bitirilirken hata

source: Error saving setup
ar: حدث خطأ أثناء حفظ الإعداد
tr: Kurulum kaydedilirken hata

# reportSavedTitle
source: Report Saved
ar: تم حفظ التقرير
tr: Rapor Kaydedildi

# reportSavedMessage
source: Day report saved successfully.
ar: تم حفظ تقرير اليوم بنجاح.
tr: Günlük rapor başarıyla kaydedildi.

source: PDF exported
ar: تم تصدير ملف PDF
tr: PDF dışa aktarıldı

source: Unknown School
ar: مدرسة غير معروفة
tr: Bilinmeyen Camii

source: Change
ar: تغيير
tr: Değiştir

source: Month
ar: الشهر
tr: Ay

# topStudents
source: Top 3 Students
ar: أفضل 3 طلاب
tr: En İyi 3 Öğrenci

source: Absent
ar: غائب
tr: Devamsız

source: Logged
ar: تم التسجيل
tr: Kaydedildi

source: Search students
ar: البحث عن الطلاب
tr: Öğrenci ara

source: Add First Student
ar: إضافة أول طالب
tr: İlk Öğrenciyi Ekle

# addStudentToGetStarted
source: Add a student to get started.
ar: أضف طالبا للبدء.
tr: Başlamak için öğrenci ekleyin.

source: No matching students
ar: لا يوجد طلاب مطابقون
tr: Eşleşen öğrenci yok

source: No students yet
ar: لا يوجد طلاب بعد
tr: Henüz öğrenci yok

# selectSchoolTitle
source: Select School
ar: اختيار الجامع
tr: Camii Seç

source: No schools found.
ar: لم يتم العثور على جوامع.
tr: Camii bulunamadı.

source: Manage Schools
ar: إدارة الجوامع
tr: Camii Yönet

source: Attendance
ar: الحضور
tr: Yoklama

source: Enter lesson details...
ar: أدخل تفاصيل الدرس...
tr: Ders detaylarını girin...

# studentUpdatedTitle
source: Student Updated
ar: تم تحديث الطالب
tr: Öğrenci Güncellendi

# studentUpdatedMessage
source: Student updated successfully.
ar: تم تحديث الطالب بنجاح.
tr: Öğrenci başarıyla güncellendi.

# studentDeletedTitle
source: Student Deleted
ar: تم حذف الطالب
tr: Öğrenci Silindi

# studentDeletedMessage
source: Student deleted successfully.
ar: تم حذف الطالب بنجاح.
tr: Öğrenci başarıyla silindi.

# fillFirstLastName
source: Please fill in first and last name
ar: يرجى إدخال الاسم الأول واسم العائلة
tr: Lütfen ad ve soyadı girin

source: View Report
ar: عرض التقرير
tr: Raporu Gör

source: Level
ar: المستوى
tr: Seviye

source: Passed
ar: نجح
tr: Geçti

source: Repeat
ar: إعادة
tr: Tekrar

source: Schools
ar: المدارس
tr: Camiler

source: Points Management
ar: إدارة النقاط
tr: Puanları Yönet

# pagesStudiedHint
source: e.g., 12, 13 or Page 12; Page 13
ar: مثال: 12، 13 أو الصفحة 12؛ الصفحة 13
tr: örn., 12, 13 veya Sayfa 12; Sayfa 13

# separateMultiplePages
source: Separate multiple pages with commas or semicolons
ar: افصل الصفحات المتعددة بفواصل
tr: Birden fazla sayfayı virgül ile ayırın

source: Additional notes
ar: ملاحظات إضافية
tr: Ek notlar

# savedTitle
source: Saved
ar: تم الحفظ
tr: Kaydedildi

# savedMessage
source: Saved successfully
ar: تم الحفظ بنجاح
tr: Başarıyla kaydedildi

# lessonSavedSuccess
source: Lesson saved successfully
ar: تم حفظ الدرس بنجاح
tr: Ders başarıyla kaydedildi

# lessonsLabel
source: Lessons
ar: الدروس
tr: Dersler

source: Add Student
ar: إضافة طالب
tr: Öğrenci Ekle

# addStudentTitle
source: Add New Student
ar: إضافة طالب جديد
tr: Yeni Öğrenci Ekle

source: Enter student name
ar: أدخل اسم الطالب
tr: Öğrenci adı girin

# enterParentPhone
source: Enter parent phone number
ar: أدخل رقم هاتف ولي الأمر
tr: Veli telefon numarasını girin

source: Select Level
ar: اختر المستوى
tr: Seviye Seçin

source: Student Added
ar: تم إضافة الطالب
tr: Öğrenci Eklendi

# studentAddedSuccess
source: Student added successfully
ar: تم إضافة الطالب بنجاح
tr: Öğrenci başarıyla eklendi

# errorTitle
source: Error
ar: خطأ
tr: Hata

source: No students
ar: لا يوجد طلاب
tr: Öğrenci yok

# pdfStudentReportTitle
source: Student Report
ar: تقرير الطالب
tr: Öğrenci Raporu

# pdfGeneralReportTitle
source: General Report
ar: التقرير العام
tr: Genel Rapor

# pdfReportDate
source: Report Date
ar: تاريخ التقرير
tr: Rapor Tarihi

# pdfSchoolName
source: School
ar: الجامع
tr: Camii

# pdfTeacherName
source: Teacher
ar: المعلم
tr: Öğretmen

# pdfClassName
source: Class
ar: الحلقة
tr: Sınıf

# pdfStudentName
source: Student
ar: الطالب
tr: Öğrenci

# pdfEntriesTableTitle
source: Lesson Entries
ar: سجلات الدروس
tr: Ders Kayıtları

# pdfDailyLessonsHistoryTitle
source: Daily Lessons Report History
ar: سجل الدروس اليومية
tr: Günlük Ders Rapor Geçmişi

# pdfColDate
source: Date
ar: التاريخ
tr: Tarih

# pdfColPageLearned
source: Page Learned
ar: الصفحة المدروسة
tr: Öğrenilen Sayfa

# pdfColPassed
source: Passed?
ar: نجح؟
tr: Geçti mi?

# pdfColNote
source: Note
ar: ملاحظة
tr: Not

# pdfColLessonNumber
source: Lesson #
ar: رقم الدرس
tr: Ders #

# pdfColLessonTaught
source: Lesson Taught
ar: الدرس المُدرَّس
tr: Öğretilen Ders

# pdfYes
source: Yes
ar: نعم
tr: Evet

# pdfNo
source: No
ar: لا
tr: Hayır

# pdfUpTo
source: Up to
ar: حتى
tr: Kadar

# pdfNoLessonsFound
source: No lessons found
ar: لم يتم العثور على دروس
tr: Ders bulunamadı

# levelLabel
source: Level
ar: المستوى
tr: Seviye

# currentPointsLabel
source: Current points
ar: النقاط الحالية
tr: Mevcut Puan
